In [23]:
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
import seaborn as sns
titanic_df = sns.load_dataset('titanic')
titanic_df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [27]:
titanic_df['age'].mean()
titanic_df.loc[titanic_df['age'].isna(), 'age'] = titanic_df['age'].median() # if value on age is NaN, update age to median()
titanic_df
# CORRECTION:
# titanic_df['age'] = titanic_df['age'].fillna(titanic_df['age'].median())

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.000000,3.000000,male,22.000000,1.000000,0.000000,7.250000,S,Third,man,True,NaN,Southampton,no,False
1,1.000000,1.000000,female,38.000000,1.000000,0.000000,71.283300,C,First,woman,False,C,Cherbourg,yes,False
2,1.000000,3.000000,female,26.000000,0.000000,0.000000,7.925000,S,Third,woman,False,NaN,Southampton,yes,True
3,1.000000,1.000000,female,35.000000,1.000000,0.000000,53.100000,S,First,woman,False,C,Southampton,yes,False
4,0.000000,3.000000,male,35.000000,0.000000,0.000000,8.050000,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0.000000,2.000000,male,27.000000,0.000000,0.000000,13.000000,S,Second,man,True,NaN,Southampton,no,True
887,1.000000,1.000000,female,19.000000,0.000000,0.000000,30.000000,S,First,woman,False,B,Southampton,yes,True
888,29.699118,29.699118,29.699118,29.699118,29.699118,29.699118,29.699118,29.699118,Third,woman,False,NaN,Southampton,no,False
889,1.000000,1.000000,male,26.000000,0.000000,0.000000,30.000000,C,First,man,True,C,Cherbourg,yes,True
890,0.000000,3.000000,male,32.000000,0.000000,0.000000,7.750000,Q,Third,man,True,NaN,Queenstown,no,True